apache/nuttx/arch/arm/src/stm32l4/stm32l4_sdmmc.c
/****************************************************************************
 * arch/arm/src/stm32l4/stm32l4_sdmmc.c
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>

#include <stdint.h>
#include <stdbool.h>
#include <string.h>
#include <assert.h>
#include <nuttx/debug.h>
#include <errno.h>

#include <nuttx/arch.h>
#include <nuttx/wdog.h>
#include <nuttx/clock.h>
#include <nuttx/sdio.h>
#include <nuttx/wqueue.h>
#include <nuttx/semaphore.h>
#include <nuttx/mmcsd.h>

#include <nuttx/irq.h>
#include <arch/board/board.h>

#include "chip.h"
#include "arm_internal.h"
#include "stm32l4_dma.h"
#include "stm32l4_gpio.h"
#include "stm32l4_sdmmc.h"

#if defined(CONFIG_STM32L4_SDMMC1) || defined(CONFIG_STM32L4_SDMMC2)

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* Configuration ************************************************************/

/* Required system configuration options:
 *
 *   CONFIG_ARCH_DMA - Enable architecture-specific DMA subsystem
 *     initialization.  Required if CONFIG_SDMMC[1|2]_DMA is enabled.
 *   CONFIG_STM32L4_DMA2 - Enable STM32 DMA2 support.  Required if
 *     CONFIG_SDMMC[1|2]_DMA  is enabled
 *   CONFIG_SCHED_WORKQUEUE -- Callback support requires work queue support.
 *
 * Driver-specific configuration options:
 *
 *   CONFIG_SDIO_MUXBUS - Setting this configuration enables some locking
 *     APIs to manage concurrent accesses on the SDMMC bus.  This is not
 *     needed for the simple case of a single SD card, for example.
 *   CONFIG_STM32L4_SDMMC_DMA - Enable SDMMC.  This is a marginally
 *    optional.  For most usages, SDMMC will cause data overruns if used
 *    without DMA.  NOTE the above system DMA configuration options.
 *   CONFIG_SDMMC1/2_WIDTH_D1_ONLY - This may be selected to force the driver
 *     operate with only a single data line (the default is to use all
 *     4 SD data lines).
 *   CONFIG_SDMMC_DMAPRIO - SDMMC DMA priority.  This can be selected if
 *     CONFIG_STM32L4_SDMMC_DMA is enabled.
 *   CONFIG_STM32L4_SDMMC_XFRDEBUG - Enables some very low-level
 *     debug output.  This also requires CONFIG_DEBUG_FS and
 *     CONFIG_DEBUG_INFO
 */

#ifndef CONFIG_STM32L4_SDMMC_DMA
#  warning "Large Non-DMA transfer may result in RX overrun failures"
#else
#  if !defined(CONFIG_STM32L4_DMA2) && !defined(CONFIG_STM32L4_DMAMUX)
#    error "CONFIG_STM32L4_SDMMC_DMA support requires CONFIG_STM32L4_DMA2"
#  endif
#  ifndef CONFIG_SDIO_DMA
#    error CONFIG_SDIO_DMA must be defined with CONFIG_STM32L4_SDMMC_DMA
#  endif
#endif

#if !defined(CONFIG_SCHED_WORKQUEUE) || !defined(CONFIG_SCHED_HPWORK)
#  error "Callback support requires CONFIG_SCHED_WORKQUEUE and CONFIG_SCHED_HPWORK"
#endif

#ifdef CONFIG_STM32L4_SDMMC1
#  ifdef CONFIG_STM32L4_SDMMC_DMA
#    ifndef CONFIG_STM32L4_SDMMC1_DMAPRIO
#        define CONFIG_STM32L4_SDMMC1_DMAPRIO DMA_SCR_PRIVERYHI
#    endif
#    if (CONFIG_STM32L4_SDMMC1_DMAPRIO & ~DMA_CCR_PL_MASK) != 0
#      error "Illegal value for CONFIG_STM32L4_SDMMC1_DMAPRIO"
#    endif
#  else
#    undef CONFIG_STM32L4_SDMMC1_DMAPRIO
#  endif
#endif

#ifdef CONFIG_STM32L4_SDMMC2
#  ifdef CONFIG_STM32L4_SDMMC_DMA
#    ifndef CONFIG_STM32L4_SDMMC2_DMAPRIO
#        define CONFIG_STM32L4_SDMMC2_DMAPRIO DMA_SCR_PRIVERYHI
#    endif
#    if (CONFIG_STM32L4_SDMMC2_DMAPRIO & ~DMA_CCR_PL_MASK) != 0
#      error "Illegal value for CONFIG_STM32L4_SDMMC2_DMAPRIO"
#    endif
#  else
#    undef CONFIG_STM32L4_SDMMC2_DMAPRIO
#  endif
#endif

#if !defined(CONFIG_DEBUG_FS) || !defined(CONFIG_DEBUG_FEATURES)
#  undef CONFIG_STM32L4_SDMMC_XFRDEBUG
#endif

/* Friendly CLKCR bit re-definitions ****************************************/

#define STM32_CLKCR_RISINGEDGE    (0)
#define STM32_CLKCR_FALLINGEDGE   STM32_SDMMC_CLKCR_NEGEDGE

/* Use the default of the rising edge but allow a configuration,
 * that does not have the errata, to override the edge the SDIO
 * command and data is changed on.
 */

#if !defined(STM32_SDMMC_CLKCR_EDGE)
#  define STM32_SDMMC_CLKCR_EDGE STM32_CLKCR_RISINGEDGE
#endif

/* Mode dependent settings.  These depend on clock divisor settings that must
 * be defined in the board-specific board.h header file:
 * STM32_SDMMC_INIT_CLKDIV, STM32_SDMMC_MMCXFR_CLKDIV, and
 * STM32_SDMMC_SDXFR_CLKDIV.
 */

#define STM32_CLCKCR_INIT           (STM32_SDMMC_INIT_CLKDIV      | \
                                     STM32_SDMMC_CLKCR_EDGE | \
                                     STM32_SDMMC_CLKCR_WIDBUS_D1)
#define STM32_SDMMC_CLKCR_MMCXFR    (STM32_SDMMC_MMCXFR_CLKDIV    | \
                                     STM32_SDMMC_CLKCR_EDGE | \
                                     STM32_SDMMC_CLKCR_WIDBUS_D1)
#define STM32_SDMMC_CLCKR_SDXFR     (STM32_SDMMC_SDXFR_CLKDIV     | \
                                     STM32_SDMMC_CLKCR_EDGE | \
                                     STM32_SDMMC_CLKCR_WIDBUS_D1)
#define STM32_SDMMC_CLCKR_SDWIDEXFR (STM32_SDMMC_SDXFR_CLKDIV     | \
                                     STM32_SDMMC_CLKCR_EDGE | \
                                     STM32_SDMMC_CLKCR_WIDBUS_D4)

/* Timing */

#define SDMMC_CMDTIMEOUT         (100000)
#define SDMMC_LONGTIMEOUT        (0x7fffffff)

/* Big DTIMER setting */

#define SDMMC_DTIMER_DATATIMEOUT (0x000fffff)

/* DMA channel/stream configuration register settings.  The following
 * must be selected.  The DMA driver will select the remaining fields.
 *
 * - 32-bit DMA
 * - Memory increment
 * - Direction (memory-to-peripheral, peripheral-to-memory)
 * - Memory burst size (F4 only)
 */

/* STM32 stream configuration register (SCR) settings base settings sans
 * priority.
 */

#define SDMMC_RXDMA32_CONFIG     (DMA_CCR_MINC | \
                                  DMA_CCR_PSIZE_32BITS | DMA_CCR_MSIZE_32BITS)
#define SDMMC_TXDMA32_CONFIG     (DMA_CCR_DIR | DMA_CCR_MINC | \
                                  DMA_CCR_PSIZE_32BITS | DMA_CCR_MSIZE_32BITS)

#ifdef DMAMAP_SDMMC1

/* SDMMC DMA Channel/Stream selection.  There
 * are multiple DMA stream options that must be dis-ambiguated in the board.h
 * file.
 */

#  define SDMMC1_DMACHAN          DMAMAP_SDMMC1
#endif

