apache/nuttx/arch/arm/src/stm32l4/stm32l4_sdmmc.c
#ifdef DMAMAP_SDMMC2

/* SDMMC DMA Channel/Stream selection.  There
 * are multiple DMA stream options that must be dis-ambiguated in the board.h
 * file.
 */

#  define SDMMC2_DMACHAN           DMAMAP_SDMMC2
#endif

/* FIFO sizes */

#define SDMMC_HALFFIFO_WORDS      (8)
#define SDMMC_HALFFIFO_BYTES      (8*4)

/* Data transfer interrupt mask bits */

#define STM32_SDMMC_RECV_MASK     (STM32_SDMMC_MASK_DCRCFAILIE | \
                                   STM32_SDMMC_MASK_DTIMEOUTIE | \
                                   STM32_SDMMC_MASK_DATAENDIE  | \
                                   STM32_SDMMC_MASK_RXOVERRIE  | \
                                   STM32_SDMMC_MASK_RXFIFOHFIE | \
                                   STM32_SDMMC_MASK_STBITERRIE)

#define STM32_SDMMC_SEND_MASK     (STM32_SDMMC_MASK_DCRCFAILIE | \
                                   STM32_SDMMC_MASK_DTIMEOUTIE | \
                                   STM32_SDMMC_MASK_DATAENDIE  | \
                                   STM32_SDMMC_MASK_TXUNDERRIE | \
                                   STM32_SDMMC_MASK_TXFIFOHEIE | \
                                   STM32_SDMMC_MASK_STBITERRIE)

#define STM32_SDMMC_DMARECV_MASK  (STM32_SDMMC_MASK_DCRCFAILIE | \
                                   STM32_SDMMC_MASK_DTIMEOUTIE | \
                                   STM32_SDMMC_MASK_DATAENDIE  | \
                                   STM32_SDMMC_MASK_RXOVERRIE | \
                                   STM32_SDMMC_MASK_STBITERRIE)

#define STM32_SDMMC_DMASEND_MASK  (STM32_SDMMC_MASK_DCRCFAILIE | \
                                   STM32_SDMMC_MASK_DTIMEOUTIE | \
                                   STM32_SDMMC_MASK_DATAENDIE  | \
                                   STM32_SDMMC_MASK_TXUNDERRIE | \
                                   STM32_SDMMC_MASK_STBITERRIE)

/* Event waiting interrupt mask bits */

#define STM32_SDMMC_CMDDONE_STA   (STM32_SDMMC_STA_CMDSENT)

#define STM32_SDMMC_RESPDONE_STA  (STM32_SDMMC_STA_CTIMEOUT | \
                                   STM32_SDMMC_STA_CCRCFAIL | \
                                   STM32_SDMMC_STA_CMDREND)

#define STM32_SDMMC_XFRDONE_STA   (0)

#define STM32_SDMMC_CMDDONE_MASK  (STM32_SDMMC_MASK_CMDSENTIE)

#define STM32_SDMMC_RESPDONE_MASK (STM32_SDMMC_MASK_CCRCFAILIE | \
                                   STM32_SDMMC_MASK_CTIMEOUTIE | \
                                   STM32_SDMMC_MASK_CMDRENDIE)

#define STM32_SDMMC_XFRDONE_MASK  (0)

#define STM32_SDMMC_CMDDONE_ICR   (STM32_SDMMC_ICR_CMDSENTC | \
                                   STM32_SDMMC_ICR_DBCKENDC)

#define STM32_SDMMC_RESPDONE_ICR  (STM32_SDMMC_ICR_CTIMEOUTC | \
                                   STM32_SDMMC_ICR_CCRCFAILC | \
                                   STM32_SDMMC_ICR_CMDRENDC  | \
                                   STM32_SDMMC_ICR_DBCKENDC)

#define STM32_SDMMC_XFRDONE_ICR   (STM32_SDMMC_ICR_DATAENDC  | \
                                   STM32_SDMMC_ICR_DCRCFAILC | \
                                   STM32_SDMMC_ICR_DTIMEOUTC | \
                                   STM32_SDMMC_ICR_RXOVERRC  | \
                                   STM32_SDMMC_ICR_TXUNDERRC | \
                                   STM32_SDMMC_ICR_DBCKENDC)

#define STM32_SDMMC_WAITALL_ICR   (STM32_SDMMC_CMDDONE_ICR   | \
                                   STM32_SDMMC_RESPDONE_ICR  | \
                                   STM32_SDMMC_XFRDONE_ICR   | \
                                   STM32_SDMMC_ICR_DBCKENDC)

/* Let's wait until we have both SDIO transfer complete and DMA complete. */

#define SDMMC_XFRDONE_FLAG  (1)
#define SDMMC_DMADONE_FLAG  (2)
#define SDMMC_ALLDONE       (3)

/* Register logging support */

#ifdef CONFIG_STM32L4_SDMMC_XFRDEBUG
#  ifdef CONFIG_STM32L4_SDMMC_DMA
#    define SAMPLENDX_BEFORE_SETUP  0
#    define SAMPLENDX_BEFORE_ENABLE 1
#    define SAMPLENDX_AFTER_SETUP   2
#    define SAMPLENDX_END_TRANSFER  3
#    define SAMPLENDX_DMA_CALLBACK  4
#    define DEBUG_NSAMPLES          5
#  else
#    define SAMPLENDX_BEFORE_SETUP  0
#    define SAMPLENDX_AFTER_SETUP   1
#    define SAMPLENDX_END_TRANSFER  2
#    define DEBUG_NSAMPLES          3
#  endif
#endif

/****************************************************************************
 * Private Types
 ****************************************************************************/

/* This structure defines the state of the STM32 SDMMC interface */

struct stm32_dev_s
{
  struct sdio_dev_s  dev;             /* Standard, base SDIO interface */

  /* STM32-specific extensions */

  uint32_t          base;
  int               nirq;
#ifdef CONFIG_MMCSD_SDIOWAIT_WRCOMPLETE
  uint32_t          d0_gpio;
#endif
#ifdef CONFIG_STM32L4_SDMMC_DMA
  uint32_t          dmapri;
#endif

  /* Event support */

  sem_t              waitsem;         /* Implements event waiting */
  sdio_eventset_t    waitevents;      /* Set of events to be waited for */
  uint32_t           waitmask;        /* Interrupt enables for event waiting */
  volatile sdio_eventset_t wkupevent; /* The event that caused the wakeup */
  struct wdog_s      waitwdog;        /* Watchdog that handles event timeouts */

  /* Callback support */

  sdio_statset_t     cdstatus;        /* Card status */
  sdio_eventset_t    cbevents;        /* Set of events to be cause callbacks */
  worker_t           callback;        /* Registered callback function */
  void              *cbarg;           /* Registered callback argument */
  struct work_s      cbwork;          /* Callback work queue structure */

  /* Interrupt mode data transfer support */

  uint32_t          *buffer;          /* Address of current R/W buffer */
  size_t             remaining;       /* Number of bytes remaining in the transfer */
  uint32_t           xfrmask;         /* Interrupt enables for data transfer */

  /* DMA data transfer support */

  bool               widebus;         /* Required for DMA support */
  bool               onebit;          /* true: Only 1-bit transfers are supported */
#ifdef CONFIG_STM32L4_SDMMC_DMA
  volatile uint8_t   xfrflags;        /* Used to synchronize SDMMC and DMA completion events */
  bool               dmamode;         /* true: DMA mode transfer */
  DMA_HANDLE         dma;             /* Handle for DMA channel */
#endif
};

/* Register logging support */

